[
    {
        "biography": "Born in the former USSR and raised a proud citizen of Chicago, Dr. Julia Alekseyeva is an author-illustrator as well as an academic. She received her PhD in Comparative Literature from Harvard, specializing in the avant-garde and film practices in France, Japan, and the former USSR. She taught at Brooklyn College, and is currently a postdoctoral fellow at the Reischauer Institute at Harvard. Julia has received press from publications such as Reuters, the New York Times, and Bloomberg Business for illustrating the first graphic novel legal brief, submitted as an amicus brief in USA vs. Apple. Her debut graphic novel, Soviet Daughter: A Graphic Revolution, was published in 2017, and has won the Virginia Library Association Graphic Novel Diversity Award. She has also published short graphic narratives for publications such as the Paper Brigade, Lilith, the Nib, and Jewish Currents. She splits her time between Boston and Brooklyn, where she lives with her partner Brandon and a dog named Leopold Bloom.",
        "url": "http://jalekseyeva.com",
        "name": "Julia Alekseyeva",
        "image": "/img/authors/Julia_Alekseyeva.jpg",
        "title": "Virginia Library Association Graphic Novel Diversity Award"
    },
    {
        "biography": "Deb Aronson has been a freelance non-fiction writer since 1997. She writes about interesting people doing unusual things. That list includes, so far, an astronaut, archaeologist, male midwife, Pulitzer Prize-winning journalist, several novelists, a photographer, an architect, and a woman who founded a summer camp for foster siblings. She feels especially at home among scientists, having come from a family full of them. She joined the Society of Children's Book Writers and Illustrators in 2008 and wrote a middle-grade biography of E.B. White in 2010 on contract. However, it wasn't until 2012 that she decided to undertake an independent book-length project she would do on her own, not on assignment. That project resulted in a biography of racehorse Rachel Alexandra: Alexandra the Great: The Record-Breaking Filly Who Ruled the Racetrack (2017). Deb earned a bachelor's degree in anthropology from Harvard University and a master's degree in Near Eastern Archaeology from Yale University. She also worked at the Metropolitan Museum of Art and participated in excavations in Syria, Cyprus, Israel, and the United States before moving to the Midwest.",
        "url": "http://www.debaronson.com/",
        "name": "Deb Aronson",
        "image": "/img/authors/Deb_Aronson.jpg",
        "title": "Award-Winning Non-Fiction Writer"
    },
    {
        "biography": "Barbara Binns is an award-winning African American author of contemporary, multicultural children's novels and adult short stories. She lives in the Chicago area, and finds writing the perfect follow-up to her life as an adoptive parent and cancer survivor. She is a member of the American Library Association (ALA), the Association of Children's Authors and Illustrators of Color (ACAIC), the Society of Children's Book Writers and Illustrators (SCBWI), and BCALA (Black Caucus of the ALA). Her debut Young Adult novel Pull won several awards, including the 2009 Golden Rose contest and the 2010 National Reader’s Choice Award in YA from the Portland Romance Writers. It was also named one of the 2012 YALSA Quick Picks for Reluctant Young Adult Readers. She has also written Being God (2012), Minority of One (2013), and numerous short stories. Her most recent creation is a middle grade novel titled Courage, published in July 2018. Binns blogs about YA and multicultural issues on her website and is a monthly guest blogger at the Romancing the Genres blog.",
        "url": "http://babinns.com/",
        "name": "Barbara Binns",
        "image": "/img/authors/Barbara_Binns.jpg",
        "title": "OKRWA National Readers’ Choice Award"
    },
    {
        "biography": "Multi-award-winning author Joseph Bruchac is a writer and traditional storyteller who lives in the house that he was raised in by his grandparents, located in the Adirondack Mountains Region of northern New York state. Founder and Executive Director of the Greenfield Review Literary Center and The Greenfield Review Press, much of his writing draws on his Abenaki American Indian ancestry. He and his two grown sons, James and Jesse, who are also storytellers and writers, work together teaching martial arts and in projects involving the preservation of Native culture, Native language renewal, teaching traditional Native skills, and environmental education at their Ndakinna Education Center. Author of over 130 books in several genres for young readers and adults, his experiences include running a college program in a maximum security prison and teaching in West Africa. Among his newer titles are Two Roads, historical fiction based in an Indian Boarding School in 1932 (2018); Sasquatch and The Muckleshoot (2018) book three in the Unicorn Rescue Society Series; Brothers of the Buffalo, historical fiction about the 1874 Red River War between the Plains tribes and the U.S. (2016); Talking Leaves, a novel about Sequoyah's creation of the Cherokee alphabet (2016); the post-apocalyptic novel trilogy Killer of Enemies, winner of the 2014 Native American Librarians Association YA Award; Trail of the Dead (2016); Arrow of Lightning (2017) and The Hunter's Promise, a picture book based on traditional Abenaki story (2015).",
        "url": "http://josephbruchac.com/",
        "name": "Joseph Bruchac",
        "image": "/img/authors/Joseph_Bruchac.jpg",
        "title": "Independent Publisher Book Award"
    },
    {
        "biography": "Crystal Chan watched with amazement at the exotic zoo outbreak in Zanesville, Ohio in 2011, where scores of animals (hungry lions, panthers, and tigers)‚ ran loose around the county. That incident helped inspire her most recent novel, All That I Can Fix (2018). When Crystal isn't writing, her passion is giving diversity talks to adults and kids alike, telling stories on Wisconsin Public Radio, and hosting conversations on social media.  Her debut novel, Bird, was published in nine countries and is available on audiobook in the U.S. She is the parent of a teenage turtle (not a ninja).",
        "url": "http://crystalchan.net/",
        "name": "Crystal Chan",
        "image": "/img/authors/Crystal_Chan.jpg",
        "title": "Elizabeth Burr / Worzalla Award"
    },
    {
        "biography": "Julia Durango is the author of picture books, novels, and poetry for kids of all ages. A few of her recent books include The One Day House (2017), The Leveller (2015), and Dream Away (2011). She has received numerous national and state awards for her writing, including the 2017 Prairie State Award for Excellence in Writing for Children and three titles on the Illinois Reads list. Julia is a proud University of Illinois at Urbana-Champaign alumna (go Illini!) and currently lives in Ottawa, Illinois with her family.",
        "url": "http://juliadurango.com/",
        "name": "Julia Durango",
        "image": "/img/authors/Julia_Durango.jpg",
        "title": "Golden Kite Fiction Award"
    },
    {
        "biography": "With nearly two million books in print, Sharon G. Flake has earned a reputation as one of the top children's and young adult authors in the nation. Her breakout novel, The Skin I'm In, established her as a must-read author among middle and high school students, as well as teachers, parents, and librarians. Flake has penned nine novels and a picture book called You Are Not a Cat. Her work has been translated into multiple languages and she has earned numerous awards and recognitions including several Coretta Scott King Honor awards, the Kirkus Reviews Top Ten Books of the Year, and the YWCA Racial Justice Award, among others.",
        "url": "https://www.scholastic.com/teachers/authors/sharon-g--flake/",
        "name": "Sharon G. Flake",
        "image": "/img/authors/Sharon_Flake.jpg",
        "title": "Detroit Free Library Outstanding Book of the Year"
    },
    {
        "biography": "Born and raised in the Rio Grande Valley, Xavier Garza is a prolific author, artist, and storyteller whose work focuses primarily on his experiences growing up in the small border town of Rio Grande City. He graduated from the University of Texas-Pan American in 1994 with a BFA in Art and has exhibited his art and performed his stories in venues throughout the United States. He is the author of Rooster Joe and the Bully / El Gallo Joe y el abusâon (2016), The Donkey Lady Fights La Llorona and Other Stories / La Senora Asno se enfrenta a La Llorona y otros cuentos (2015), Maximilian & The Mystery of the Guardian Angel: A Bilingual Lucha Libre Thriller (2011), Kid Cyclone Fights the Devil and Other Stories / Kid Ciclon se enfrenta a el Diablo y otras historias (2010), Zulema and the Witch Owl / Zulema y la Bruja Lechuza (2009), Charro Claus and the Tejas Kid (2008), Juan and the Chupacabras / Juan y el Chupacabras (2006), Lucha Libre: The Man in The Silver Mask: A Bilingual Cuento (2005), and Creepy Creatures and Other Cucuys (2004). Xavier Garza lives with his family in San Antonio.",
        "url": "https://www.cincopuntos.com/authors_detail.sstg?id=47",
        "name": "Xavier Garza",
        "image": "/img/authors/Xavier_Garza.jpg",
        "title": "NAACS Tejas Young Adult Book Award"
    },
    {
        "biography": "Dan Keding is an award-winning internationally acclaimed storyteller, author and musician who has been featured at some of the most prestigious storytelling events in the U.S., Great Britain, Ireland, and Canada. He was inducted into the National Storytelling Network's Circle of Excellence in 2000. Dan grew up in a household with his Croatian grandmother and was taught over thirty folktales from her that had been handed down for generations through their family. He has a Master’s Degree in Folktale and Ballad Studies from The University of Illinois at Springfield and serves as an Adjunct Lecturer at the Information School at the University of Illinois. His recordings and books have won numerous awards including Anne Izard Awards and Storytelling World Awards. He lives in Urbana, Illinois with his wife Tandy Lacy and Australian Shepherd Mac.",
        "url": "http://www.dankeding.com/",
        "name": "Dan Keding",
        "image": "/img/authors/Dan_Keding.jpg",
        "title": "Storytelling World Award"
    },
    {
        "biography": "Alice B. McGinty is the award-winning author of over 40 books for children, including the 2015 Sydney Taylor Notable book, Rabbi Benjamin's Buttons (illustrated by Jennifer Black Reinhardt) and the picture book biography, Gandhi: A March To the Sea (illustrated by Thomas Gonzales), which was awarded as an honor book for the 2014 South Asia Book Award for Children's And Young Adult Literature, and selected as a 2016 Illinois Reads Book. Her picture book biography, Darwin (2009, illustrated by Mary Azarian) received a 2010 Orbis Pictus Honor, and was listed on Booklist's 2009 Top Ten Biographies for Youth. Other publications include Eliza's Kindergarten Pet (2010, illustrated by Nancy Speir), Thank You, World (2007, illustrated by Wendy Anderson Halperin), and nonfiction books on subjects ranging from nutrition to tarantulas. She looks forward to the upcoming release of the following books: Pancakes to Parathas: Breakfast Around the World (2019), The Girl Who Named Pluto: The Story of Venetia Burney (2019), Bathe the Cat (2020), The Sea Knows (with coauthor Alan Havis, 2020), The Water Lady, Truck Says Moo, and A Story for Small Bear. Alice B. McGinty is a frequent presenter at schools and libraries, a children's book reviewer and writing coach, the director of Words on Fire, a summer writing camp for teens, and the Co-Regional Advisor for the Illinois Chapter of the Society of Children's Book Writers and Illustrators.",
        "url": "http://www.alicebmcginty.com/",
        "name": "Alice McGinty",
        "image": "/img/authors/Author Headshots/Alice McGinty.jpg",
        "title": "NCTE Orbis Pictus Award"
    },
    {
        "biography": "MJ Mouton grew up in the small town of Iowa, Louisiana. After school, he went to work in the environmental field and developed a love for the science that was present in his job. There were so many amazing things about the Earth that he had not realized or was not inspired to know as a student in school. Realizing these things, he became passionate, not only about geology, biology, and the physical nature of things, but also sharing what he had learned. As the father of two girls and a lover of all things scientific, MJ decided to write short stories to teach his daughters science basics, and hopefully give them the inspiration that he missed out on that young in life. He created over 40 stories that highlight scientists and the world-changing discoveries that they made, including Charlie and the Tortoise. M.J. shares his time between the area where he grew up and Chicago.",
        "url": "http://tinythinkersbooks.com/",
        "name": "Mario (MJ) Mouton",
        "image": "/img/authors/MJ_Mouton.jpg",
        "title": "Tiny Thinkers Series"
    },
    {
        "biography": "Concrete Cowboy, Yummy: The Last Days of a Southside Shorty",
        "url": "https://www.gregneri.com",
        "name": "Greg Neri",
        "image": "/img/authors/Author Headshots/Greg Neri.jpg",
        "title": "Author" 
    },
    {
        "biography": "Patricia Hruby Powell, formerly a dancer, storyteller, and librarian, is the author of Struttin' With Some Barbecue: Lil Hardin Armstrong Becomes the First Lady of Jazz (2018), a Junior Library Guild Selection as well as Josephine: The Dazzling Life of Josephine Baker (2014), which garnered Sibert, Boston Globe Horn Book, and Bologna Ragazzi Honors; and Loving vs. Virginia (2017), a Junior Library Guild Selection and Arnold Adoff Poetry Honor. Forthcoming are books about Ella Baker, and women's suffrage. She has been a mentor for organizations such as We Need Diverse Books (WNDB) and Society of Children's Book Writers-Michigan.",
        "url": "http://talesforallages.com/",
        "name": "Patricia Hruby Powell",
        "image": "/img/authors/Patricia_Hruby_Powell.jpg",
        "title": "Parent’s Choice Gold Award"
    },
    {
        "biography": "Stacey Robinson, an Assistant Professor of graphic design at the University of Illinois at Urbana-Champaign is an Arthur Schomburg fellow who completed his Masters of Fine Art at the University at Buffalo. His work discusses ideas of \"Black Utopias\" as decolonized spaces of peace by considering Black affluent, self-sustaining communities, Black protest movements and the art that document(ed) them. As part of the collaborative team Black Kirby with artist John Jennings, he creates graphic novels, gallery exhibitions, and lectures that deconstruct the work of artist Jack Kirby to re-imagine Black resistance spaces inspired by Hip Hop, religion, the arts, and sciences.   His latest graphic novel I Am Alfonso Jones with writer Tony Medina was published in 2017.",
        "url": "http://staceyrobinson.tumblr.com/",
        "name": "Stacey Robinson",
        "image": "/img/authors/Stacey_Robinson.jpg",
        "title": "YALSA Top Ten Great Graphic Novels for Teens"
    },
    {
        "biography": "Ted Sanders is the author of The Keepers, a four-book middle grade series, with the latest book published in 2018. His first book, the short story collection for a general audience, No Animals We Could Name (2012), won the 2011 Bakeless Prize for Fiction. His stories and essays have appeared in the O. Henry Prize Stories, The Southern Review, Cincinnati Review, Georgia Review, and Gettysburg Review. A recipient of a 2012 National Endowment for the Arts literature fellowship, he lives with his family in Urbana, Illinois, where he teaches at the University of Illinois.",
        "url": "http://www.tedsanders.net/",
        "name": "Ted Sanders",
        "image": "/img/authors/sanders.jpg",
        "title": "Publisher’s Lunch Buzz Books"
    },
    {
        "biography": "Senzai is the author of award-winning Shooting Kabul, chosen by the Asian Pacific Librarians Association as their Young Adult Literature winner and an NPR's Backseat Book Club pick, along with Edgar Award nominee Saving Kabul Corner and YALSA pick Ticket to India. She spent her childhood in San Francisco, California, and Jubail, Saudi Arabia, and attended high school in London, England where she was voted \"most likely to lead a literary revolution\" due to her ability to get away with reading comic books in class. Her latest book is Escape from Aleppo, about a girl fleeing Syria at the advent of the Arab Spring.",
        "url": "http://nhsenzai.com/",
        "name": "Naheed Hasnat (N.H.) Senzai",
        "image": "/img/authors/NH_Senzai.jpg",
        "title": "Edgar Award Nominee"
    },
    {
        "biography": "Tom Watson is the author of the Stick Dog and Stick Cat series. \"Very handsome\" is the author's self-description. In a prior life, Tom was a speech writer who also worked in marketing and advertising. Tom lives in Chicago with his wife, son, daughter, and their dog Shadow.",
        "url": "http://stickdogbooks.com/index.php/stickcat_the_author",
        "name": "Tom Watson",
        "image": "/img/authors/Tom_Watson.jpg",
        "title": "Bluestem Book Award Nominee"
    }, 
    {
        "biography": "Glitter Everywhere!",
        "url": "https://chrisbarton.info",
        "name": "Chris Barton",
        "image": "/img/authors/Author Headshots/Chris Barton.png",
        "title": "Children's Author"
    }, 
    {
        "biography": "Twelve Dinging Doorbells",
        "url": "https://tamekafryerbrown.com",
        "name": "Tameka Fryer Brown",
        "image": "/img/authors/Author Headshots/Tameka Fryer Brown.jpg",
        "title": "Picture Book Author"
    }, 
    {
        "biography": "Jasmine Toguchi",
        "url": "https://debbimichikoflorence.com",
        "name": "Debbi Michiko Florence",
        "image": "/img/authors/Author Headshots/Debbi Michiko Florence.jpg",
        "title": "Children's Author"
    }, 
    {
        "biography": "Vitamina T for Tacos, Vitimina C for Cultura",
        "url": "https://suzannemateus.com",
        "name": "Suzanne Garcia-Mateus",
        "image": "/img/authors/Author Headshots/Suzanne Mateus.jpg",
        "title": "Assistant Professor, Children's Writer"
    }, 
    {
        "biography": "Lucha Libra: The Man in the Silver Mask, La Llorona Can't Scare Me",
        "url": "https://www.goodreads.com/author/show/289361.Xavier_Garza",
        "name": "Xavier Garza",
        "image": "/img/authors/Author Headshots/Xavier Garza.jpg",
        "title": "Author/Illustrator"
    }, 
    {
        "biography": "When We Become Ours, Same and the Incredible African American Food Fight",
        "url": "https://www.shannongibney.com",
        "name": "Shannon Gibney",
        "image": "/img/authors/Author Headshots/Shannon Gibney.jpg",
        "title": "Writer, Educator, Activist"
    }, 
    {
        "biography": "Hurry Kate, or You'll be Late, Rooting for Plants",
        "url": "https://janiceharrington.com",
        "name": "Janice Harrington",
        "image": "/img/authors/Author Headshots/Janice Harrington.jpg",
        "title": "Storyteller, Poet, Children's Writer"
    }, 
    {
        "biography": "The Fish of Small Wishes, Barrio Rising: The Protest that Built Chicano Park",
        "url": "https://www.magdalenamora.com",
        "name": "Magdalena Mora",
        "image": "/img/authors/Author Headshots/Magdalena Mora.jpg",
        "title": "Illustrator"
    }, 
    {
        "biography": "Homeland",
        "url": "https://hannahmoushabeck.com",
        "name": "Hannah Moushabeck",
        "image": "/img/authors/Author Headshots/Hannah Moushabeck.jpg",
        "title": "Author, Editor, Marketer"
    }, 
    {
        "biography": "The Magic Fish",
        "url": "https://www.trungles.com",
        "name": "Trung Le Nguyen",
        "image": "/img/authors/Author Headshots/Trung Le Nguyen.jpg",
        "title": "American Cartoonist"
    }, 
    {
        "biography": "Dragon King Chronicles",
        "url": "https://www.ellenoh.com",
        "name": "Ellen Oh",
        "image": "/img/authors/Author Headshots/Ellen Oh.jpg",
        "title": "Author"
    }, 
    {
        "biography": "Anger is a Gift, The sun and the Star",
        "url": "https://www.markoshiro.com",
        "name": "Mark Oshiro",
        "image": "/img/authors/Author Headshots/mark oshiro.jpg",
        "title": "Author"
    }, 
    {
        "biography": "Miles Morales Series",
        "url": "https://www.justinareynolds.com",
        "name": "Justin A. Reynolds",
        "image": "/img/authors/Author Headshots/justin reynolds.jpg",
        "title": "Author, Screenwriter"
    }, 
    {
        "biography": "Apple in the middle, Jo Jo Makoons Series",
        "url": "https://dawnquigley.com/bio/",
        "name": "Dawn Quigley",
        "image": "/img/authors/Author Headshots/dawn quigley.png",
        "title": "Author, Educator"
    }
]
