[
    {
        "title": "The Role of Online Museum Experiences in Supporting At-Home Science Learning in the Era of COVID-19",
        "pi": "PI: Catherine Dornfeld Tissenbaum, C&I; Co-PI: Stina Krist, C&I; Graduate Student: McKenna Lane, C&I",
        "description": "This project will study families’ interactions with online museum experiences, focusing on resources and constraints in their access and participation; science learning outcomes and connection to teacher-assigned activities; and families’ own strategies for learning."
    },
    {
        "title": "The Role of Community-based Immigrant-Serving Non- Profits in Bridging Home and School during COVID-19",
        "pi": "PI: Liv Davila, EPOL; Graduate Student: Lucero Garcia-Villegas, EPOL; Graduate Student: Susan Ogwal, EPOL",
        "description": "COVID-19 has heightened public awareness of social inequalities that present barriers to educational success within immigrant and refugee youth and their families. This research will explore the perspectives of leaders of community-based non-profit organizations in Champaign County, IL that focus on providing social (including educational) supports to immigrant and refugee families during COVID-19."
    },
    {
        "title": "Pilot Evaluation of We CU: A campus-wide program that strengthens student community engagement to meet the needs of Illinois communities during COVID-19",
        "pi": "PI: Chris Napolitano, EPSY; Co-PI: Emily Stone, Bureau of Educational Research; Co-PI: Brent Roberts, Psychology; Graduate Student: Jisoo Youn, EPSY; Graduate Student: Madison Sewell, EPSY",
        "description": "The We CU program facilitates and a student-led volunteer responses to COVID-19. This project will evaluate both the participation of student volunteers and the impact of the program, including assessing volunteers’ behavioral, emotional, and social skills like leadership, empathy, and stress resistance, and the role that We CU participation plays in their career development."
    },
    {
        "title": "E-Learning During a Global Pandemic: Adapting preschool to a socially distant reality",
        "pi": "PI: Giselle Martinez Negrette, C&I; Co-PI: Stephanie Sanders-Smith, C&I; Graduate Student: Jadyn Harris, C&I; Graduate Student: Rachita Rana, EPOL",
        "description": "Preschools moving online during the COVID-19 pandemic have created opportunities for considering what is possible in an online preschool classroom and, further, the role of preschool in supporting culturally and linguistically diverse students. This work examines bilingual preschools that have been able to move online quickly and maintain quality educational experiences, investigating how early childhood programs have adapted preschool curricula and pedagogy to e-learning environments."
    },
    {
        "title": "Do K-12 School Closures Slow the Spread of COVID-19?",
        "pi": "PI: Rebecca Hinze-Pifer, EPOL",
        "description": "Given the phenomenally high cost of school closure, along with clear indications that school closure exacerbates existing social inequalities, this study will estimate the impact of school closure on COVID-19 transmission and contribute to a growing knowledge on the role of school closure in COVID-19 control, in the face of public and scientific skepticism, providing critical guidance to allow public health officials and policymakers to build a path through the next year."
    },
    {
        "title": "City Settlers: Transforming a collaborative STEM education game for COVID-19 online use",
        "pi": "PI: Mike Tissenbaum, C&I; External Consultant: Vikesh Kumar, University of Wisconsin; Graduate Student: Litong Zheng, C&I; Undergraduate Student: Ruby Wang, College of Engineering; Graduate Student: Taehyun Kim, C&I; Undergraduate Student: Zhanchen Huang, School of Information Sciences",
        "description": "City Settlers is a multiplayer participatory simulation where student teams collaboratively manage, grow, and sustain cities. Prior to COVID, City Settlers was to run in middle school classrooms. In response to COVID, the game will be converted into a standalone online version, enabling learners to play at a distance while still engaging in interdisciplinary STEM learning."
    },
    {
        "title": "The HigherEd COVID-19 Response (HECR) Study Evaluation of Higher Education Institutional Responses during COVID-19 on Student Sociocultural Factors",
        "pi": "PI: Nidia Ruedas-Gracia, EPSY; Co-PI: Rodney Hopson, EDPSY; Graduate Student: Ananya Tiwari, EPSY",
        "description": "In light of COVID-19, universities around the world exhibited rapid shifts in the way courses were delivered for spring 2020. This study will evaluate the impact of university responses during COVID-19 on student-level sociocultural factors (e.g., sense of belonging to the university, psychological wellbeing, academic motivation to remain in their institution, etc.). This multi-phase study will be a quantitative and qualitative exploratory pilot study at a Midwest public university during summer 2020."
    },
    {
        "title": "Student Experiences Amid the COVID-19 Pandemic: Examining the aspirations and beliefs of Black males who play sports in a K-12 setting",
        "pi": "PI: Adeyemo Adeoye, EPOL; Co-PI: Nathan Castillo, EPOL",
        "description": "While Black males are praised for their athletic accomplishments, they are not often expected to achieve academic success. The suspension of athletic competition due to the pandemic has raised new questions about athletic and academic aspirations and beliefs of Black males who play sports. This project will explore the impact of the suspension of athletic competition on the educational aspirations and beliefs of Black males who play sports in K-12 settings."
    },
    {
        "title": "Changes in Undergraduate STEM Motivation Due to COVID-19",
        "pi": "PI: Jennifer Cromley, EPSY; Graduate Student: Andrea Kunze, EPSY; Undergraduate Student: Elizabeth Zelenka, EPSY",
        "description": "The pandemic has brought about a global move to online instruction. Related to this move, this project will investigate changes observed and documented at the University of Illinois in undergraduate biology students’ motivation for biology and their intention to remain in STEM."
    },
    {
        "title": "COVID-19 Risk Mitigation: Interactive Automatic Counselor",
        "pi": "PI: Dan Morrow, EPSY; Co-PI: H. Chad Lane, EPSY; Co-PI: Suma Bhat, Electrical and Computer Engineering; Co-PI: Mark Hasegawa-Johnson, Electrical and Computer Engineering",
        "description": "The general public needs to make many decisions related to risk as they navigate day-to-day uncertainties related to COVID-19. This project will develop a prototype Interactive Automatic Counselor, an (AI) risk assessment tool that educates and helps people make these decisions."
    }
]