[
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "CHERIE AVENT",
        "subheader": "Assistant Professor, Educational Psychology",
        "text": "Cherie M. Avent received her Ph.D. in Educational Research, Measurement, and Evaluation from the University of North Carolina Greensboro. Prior to pursuing her doctorate, she taught at the Guilford Technical Community College in North Carolina. Cherie’s research focuses on issues related to social justice and communication in program evaluation, with particular focus on STEM evaluation and contexts serving underrepresented minorities. She has evaluated multiple education projects and programs funded by organizations such as the National Science Foundation, U.S. Department of Education, and the College Foundation of North Carolina. Cherie is also co-program chair of the American Evaluation Association STEM Education and Training Topical Interest Group. Cherie believes it is important to build a strong theoretical and methodological foundation that students can use to inform their practice while also promoting equity and democracy. "
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "PAUL BRUNO",
        "subheader": "Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Paul Bruno is a doctoral candidate studying Urban Education Policy at the University of Southern California (USC), where he also earned a master’s degree in Economics. His research uses quantitative methods to understand issues of school finance, resource allocation in schools, and new teacher personnel management. His work has been published in Educational Evaluation and Policy Analysis, Journal of Education Finance, American Educational Research Journal, and Educational Leadership. Prior to enrolling at USC, Paul taught middle school science in Oakland and Los Angeles, California. Before teaching, he received a master’s degree in Science and Math Education and bachelor’s degrees in Philosophy and Molecular Biology from the University of California, Berkeley. Paul grew up in the suburbs of Chicago, and now collaborates with his wife, a computer science education researcher."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "MELISSA GOODNIGHT",
        "subheader": "Assistant Professor, Educational Psychology",
        "text": "Melissa R. Goodnight holds a Ph.D. in Comparative and International Education from the University of California Los Angeles (UCLA). Her research interests include monitoring and evaluation, qualitative and mixed methods research design, social justice theories, and writing pedagogy. Prior to UCLA, Melissa worked for the Urban Education Institute at the University of Chicago, where she managed and helped facilitate professional development programs for a network of 20 primary, middle, and secondary schools in Chicago. She is passionate about increasing educational access and quality for underserved and historically marginalized communities. Her recently published articles detail persisting social justice concerns within India’s K-12 school system and their implications for evaluation and research design."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "OSLY FLORES",
        "subheader": "Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Osly J. Flores received his Ed.D. in School Leadership in the Department of Administrative and Policy Studies in the School of Education at the University of Pittsburgh in 2017. His research interests focus on investigating and furthering research and practices of school leaders who move toward fairness and justice in leadership. Particular areas of research interest include race-conscious school leadership, school leaders of color, and ethical leadership. In addition, a second area of research interest is in higher education, specifically uncovering supportive practices toward graduate students of color. Prior to coming to Illinois, Osly served as an education specialist within the state of Massachusetts’ Department of Elementary and Secondary Education."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "JON HALE",
        "subheader": "Associate Professor, Education Policy, Organization & Leadership",
        "text": "Jon N. Hale earned his Ph.D. in Educational Policy Studies with a specialization in the History of Education from the University of Illinois at Urbana-Champaign in 2009. His research focuses on the history of student and teacher activism, education reform during the Civil Rights movement, and the intersection of race and progressivism in the social studies classroom. Jon’s other professional interests include the history of grassroots education reform efforts, the origins of school choice and neoliberal education policy, and the implementation of the Freedom School model. He is also interested in public, local, and oral history as a means to facilitate community engagement and educational reform. Jon’s research has been recognized through awards from the National Academy of Education, the Spencer Foundation, the American Educational Research Association, and the American Education Studies Association.   "
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "HYUN-SOOK KANG",
        "subheader": "Associate Professor, Education Policy, Organization & Leadership",
        "text": "Hyun-Sook Kang joined the College of Education in Spring 2020, teaching qualitative and mixed-methods research methods and contributing to student mentoring in the Global Studies in Education and Diversity and Equity programs within the Department of EPOL. After earning her Ph.D. in Educational Linguistics from the University of Pennsylvania, she was on the faculty in the Linguistics Department at Illinois, Illinois State University, and the University of Texas at San Antonio. Hyun’s research interests center on language learning and practice in relation to global mobility, such as immigration and study abroad. Her works have appeared in several international peer-reviewed journals and she is currently serving as Co-editor of Journal of Language, Identity, and Education."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "SAMANTHA LINDGREN",
        "subheader": "Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Samantha Bonnell Lindgren received her doctorate in Agricultural and Biological Engineering from the Grainger College of Engineering at Illinois. Her research examines the role of education for sustainable development and the agentive capacity of youth in international engineering. Her current work is funded by the Link Foundation and is focused on the impact of youth-oriented sustainability education on communities in rural Namibia, and the involvement of youth in a USAID-agriculture project in Cambodia. Samantha is affiliated faculty in the College of Engineering’s Technology Entrepreneurship Center where she will also be teaching. Previously, she was a secondary science teacher before joining the College of Education in 2013 as the Coordinator of STEM Teacher Development in the Office for Mathematics, Science, and Technology Education (MSTE)."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "CURTIS MASON",
        "subheader": "Teaching Associate Professor, Education Policy, Organization & Leadership",
        "text": "Curtis Mason received his Ph.D. in Cultural and Educational Policy Studies at Loyola University, Chicago. Curtis received his bachelor’s degree in English from Truman State University and his master’s in Education from the University of Missouri-Kansas City. He worked as a high school English teacher in Excelsior Springs, Missouri, and as a middle school instructor in Raytown, Missouri. He has also taught courses at Benedictine College, University of Missouri-Kansas City, and Loyola University-Chicago. Curtis’ main research areas are the history of American education and education policy. He is most interested in the rhetoric surrounding educational change, especially in early- and mid-twentieth century American educational policies. "
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "JENNIFER NELSON",
        "subheader": "Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Jennifer L. Nelson is an organizational sociologist who studies schools as workplaces for teachers and principals. After completing her Ph.D. in Sociology at Emory University in 2018, she worked as an IES postdoctoral fellow at Vanderbilt University’s Peabody College. Jennifer uses field research methods to investigate how aspects of the organizational environment, such as demographic composition of teaching faculty, spatial arrangements in the workplace, and the principal’s leadership practices shape teachers’ coworker support and relationships. Her other research examines urban teachers’ job reward bundles as predictors of turnover, early childhood teachers’ identity strategies for safeguarding dignity at work, the role of organizational justice in predicting teacher trust, and determinants of state-level adoption of alternative teacher certification laws."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "ERICA MASON",
        "subheader": "Assistant Professor, Special Education",
        "text": "Erica N. Mason earned her Ph.D. from the University of Missouri in 2020. She completed her bachelor’s degree in Communication at William Jewell College and her master’s in Special Education at Loyola University, Chicago. Erica is an interdisciplinary thinker who enjoys working between the fields of special education and mathematics education. At Missouri, she had to opportunity to collaborate on an NSF-funded research project at the intersection of these two areas. Erica’s work is aimed at understanding teachers’ views of their students as mathematically capable, and especially how those views get translated into opportunities for students with disabilities to engage in rigorous mathematical activity."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "AMBER RAY",
        "subheader": "Assistant Professor, Special Education",
        "text": "Amber B. Ray, Ph.D., joins the Department of Special Education from the University of Hawaii. Her research interests include writing and reading interventions and instruction to help students with disabilities and diverse learning needs succeed. Her research focuses on strategy and self-regulation approaches to instruction and methods of professional development for teachers and school leaders on effective writing and reading instruction. She has experience teaching students with learning disabilities, autism, intellectual disabilities, and emotional and behavioral disorders. Amber received her doctorate in Learning, Literacies, and Technologies specializing in Special Education from Arizona State University."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "PATRICK RICE",
        "subheader": "Clinical Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Patrick L. Rice brings years of diverse administrative expertise to the Department of EPOL. He was the former Field Services/Equity Director for the Illinois Association of School Boards for almost a decade. From 2006-2010, Patrick was an adjunct professor for McKendree College in Lebanon, Illinois, and building principal for the Mount Vernon City Schools, District 80. In addition, he was a building administrator for Danville School District 118 and East St. Louis School District 189. Prior to becoming an administrator, Patrick taught U.S. History for East St. Louis District 189 and Springfield Public School District 186. He is the author of three best-selling books: Equity, From the Boardroom to the Classroom; Vanishing School Boards; and The Essential Quick Flip Reference Guide for School Board Members, and over 25 professional publications in the areas of school governance, equity, leadership, and parental/community involvement."
    },
    {
        "image": "/img/faculty/.png",
        "username": "",
        "header": "REBECCA TAYLOR",
        "subheader": "Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Rebecca M. Taylor was an assistant professor of education at Suffolk University, where she investigated the ethics of higher education policy and practice and taught courses in higher education administration and community engagement. Previously, she was a postdoctoral fellow and director of the Ethically Engaged Leaders Program at Emory University’s Center for Ethics and worked on college access for justice-involved students as a Research Associate in the Stanford Criminal Justice Center (SCJC) at Stanford Law School. Rebecca holds a doctoral degree in Education from Stanford University, a master’s degree in Peace, Conflict, and Development Studies from Universitat Jaume I, and a bachelor’s degree with honors in Mathematics and Philosophy from Washington University, St. Louis. Rebecca’s commitment to educational justice manifests in her scholarship on ethics and justice in educational policy and practice.     "
    }
]