[
    {
        "image": "/img/faculty/ron-jacobs.png",
        "username": "",
        "header": "Ron Jacobs",
        "text": "professor in Education Policy, Organization & Leadership, was inducted into the Academy of Human Resource Development (AHRD) Scholar Hall of Fame. Jacob’s research topics include knowledge work, formal learning in the work setting, employee competence, and adapting HRD practices to the societal level. He has written over 100 journal articles and book chapters and has authored or edited six books that address a broad range of topics in the human resource development field. In his 40 years serving at three universities, Jacobs has graduated more than 300 master’s and 68 doctoral students, 38 of whom serve as professors around the world."
    },
    {
        "image": "/img/faculty/gloriana-gonzalez.png",
        "username": "",
        "header": "Gloriana González",
        "text": "associate professor in Curriculum & Instruction, was accepted into the 2020 New Leadership Academy Fellows Program, a partnership between the National Forum on Higher Education for the Public Good (National and the American Association of Hispanics in Higher Education (AAHHE). Additionally, she and her collaborators at the University of Puerto Rico concluded the first year of data collection for the National Science Foundation-funded project, Developing technological pedagogical content knowledge of pre-service math teachers by enhancement of a methods course using instrumental orchestration and lesson study strategies."
    },
    {
        "image": "/img/faculty/rodney-hopson.png",
        "username": "",
        "header": "Rodney Hopson",
        "text": "professor in Educational Psychology, was named a PI on the National Science Foundation INCLUDES Alliance award, Supporting Emerging Aquatic Scientists (SEAS) Islands Alliance. INCLUDES projects develop partnerships among stakeholders across public, private, and academic sectors, share promising practices for broadening participation and other useful data, contribute to the knowledge base on broadening participation in STEM through research, and establish a framework for supporting communications and networking."
    },
    {
        "image": "/img/faculty/jennifer-delaney.png",
        "username": "",
        "header": "Jennifer Delaney",
        "text": "associate professor in Education Policy, Organization & Leadership, was appointed by Governor J.B. Pritzker to the Illinois Board of Higher Education. Delaney was also awarded a Joyce Foundation Grant for her project titled Effects of Direct Admission Policies for Low-Income Students and Students of Color. Previously, she worked for the Advisory Committee on Student Financial Assistance, the National Center for Public Policy and Higher Education, and served as a consultant for the Commission on the Future of Higher Education."
    },
    {
        "image": "/img/faculty/jessica-li.png",
        "username": "",
        "header": "Jessica Li",
        "text": "professor in Education Policy, Organization & Leadership, was selected to the Provost’s 2020-21 Building Pathways for Emerging Leaders at Illinois cohort. The Building Pathways program is for emerging leaders (senior associate professors or newly-promoted full professors) who have an interest in exploring leadership and administrative roles. Jessica is also the Chair of the Education and Workforce Development Working Group, Discovery Partners Institute, University of Illinois System."
    },
    {
        "image": "/img/faculty/giselle-martinez-negrette.png",
        "username": "",
        "header": "Giselle Martinez Negrette",
        "text": "assistant professor in Curriculum & Instruction, was awarded a Campus Research Board grant to examine Teachers’ Ideologies and Attitudes Toward Sociocultural Competence in Dual Language Immersion Programs. Martinez Negrette was also selected as part of the 2020-2022 National Council of Teachers of English (NCTE) Research Foundation’s Cultivating New Voices Among Scholars of Color (CNV) program. In addition, her dissertation was recognized with an Honorable Mention Dissertation Award from the American Educational Research Association (AERA), Latina/o/x Research Issues SIG."
    },
    {
        "image": "/img/faculty/adrienne-dixson.png",
        "username": "",
        "header": "Adrienne Dixson",
        "text": "professor in Education Policy, Organization & Leadership, was selected to the Diversity Scholars Network at the University of Michigan. Dixson is also is part of a team awarded a grant from the Spencer Foundation for COVID-19 related research. Her project, called Whose Home for Home School?: Black “essential worker” mothers and their experiences with distance learning during COVID-19 is one of the 20 projects selected from nearly 1,400 grant submissions. Dixson received the 2020 Scholars of Color Mid-Career Contribution Award from the American Educational Research Association."
    },
    {
        "image": "/img/faculty/wenhao-david-huang.png",
        "username": "",
        "header": "Wenhao David Huang",
        "text": "associate professor in Education Policy, Organization & Leadership, collaborated on the project Identifying Depression through Early Awareness (IDEA) Women’s Health Coalition, with School of Social Work faculty and has been awarded the Dean’s Prize for Innovation and Collaboration from Social Work Dean Steven Anderson. Huang’s research is focused on implementation of interventions looking at how to optimize individuals’, organizations’, and communities’ motivation and capabilities to engage with intended interventions for the purpose of change."
    },
    {
        "image": "/img/faculty/jessica-hardy.png",
        "username": "",
        "header": "Jessica Hardy",
        "text": "assistant professor in Special Education, was awarded a Hardie Faculty Fellow grant to study the effects of a math intervention on the early math skills of preschoolers with disabilities. Hardy is developing an app that can be used to assess young children’s math abilities and individualize instruction in target skills. She has conducted research on the use of systematic instruction to support preschool children in learning early math skills, such as counting, patterning, and classification. She also studies the use of coaching as a professional development approach to support preschool teachers’ use of evidence-based practices."
    },
    {
        "image": "/img/faculty/meghan-burke.png",
        "username": "",
        "header": "Meghan Burke",
        "text": "associate professor in Special Education, was named a 2020-21 University Scholar. The program was created to reward outstanding faculty members in the University of Illinois System. Burke was also named Fellow of the American Association on Intellectual and Developmental Disabilities (FAAIDD). Individuals may be nominated after they have had at least seven years of continuous membership in AAIDD, participation in the professional and business affairs of the Association, and are judged to have made a meritorious contribution to the field of intellectual disability."
    },
    {
        "image": "/img/faculty/rosa-milagros-santos.png",
        "username": "",
        "header": "Rosa Milagros Santos",
        "text": "professor in Special Education, was appointed by Governor J.B. Pritzker to the statewide Illinois Interagency Council on Early Intervention. The council advises and assists in development, implementation, and evaluation of early intervention and education programs for children with disabilities and their families. In her particular role on the council, Santos is involved in the preparation of professional personnel to serve infants and toddlers similar to those eligible for services under the Early Intervention Services System and will serve a three-year term."
    },
    {
        "image": "/img/faculty/eboni-zamani-gallaher.png",
        "username": "",
        "header": "Eboni Zamani-Gallaher",
        "text": "professor in Education Policy, Organization & Leadership and director of the Office of Community College Research and Leadership was named executive director of the Council for the Study of Community Colleges which is now housed at the University of Illinois Urbana-Champaign. She received a Strengthening Career Technical Education grant from the Illinois Community College Board (ICCB) to support the improvement of career and technical education programming throughout the Illinois community college system. In June 2020 Zamani-Gallaher also recived a significant Bill & Melinda Gates Foundation Grant.        "
    },
    {
        "image": "/img/faculty/stacy-dymond.png",
        "username": "",
        "header": "Stacy Dymond",
        "text": "professor in Special Education, was awarded ISBE Funding for Illinois Center for Transition and Work. Dymond and David Strauser (College of AHS: Community Health Program) will create a state-wide training and technical assistance center that specifically focuses on transition from school to work for students with significant disabilities (e.g., intellectual disability, multiple disabilities, autism). She has directed numerous grant funded projects related to service learning, access to the general curriculum, personnel preparation, and the development of leadership personnel."
    },
    {
        "image": "/img/faculty/rochelle-gutierrez.png",
        "username": "",
        "header": "Rochelle Gutiérrez",
        "text": "professor in Curriculum & Instruction, received Spencer Foundation funding for her proposal, Political Conocimiento in Teaching Mathematics: Preparing Teachers to Advocate for Students. Her scholarship focuses on issues of identity and power in mathematics education, paying particular attention to how race, class, and language affect teaching and learning. The Spencer Foundation has been a leading funder of education research since 1971 and is the only national foundation focused exclusively on supporting education research. Jennifer Cromley, associate professor in Educational Psychology, was recently named the new co-editor of the journal Applied Cognitive Psychology, a bimonthly peer-reviewed scientific journal covering experimental research in cognitive psychology. Cromley’s research focuses on two broad areas: reading comprehension of illustrated scientific text and cognitive and motivational predictors of STEM students’ achievement and retention and includes both studies of basic processes and classroom interventions."
    },
    {
        "image": "/img/faculty/arlette-willis.png",
        "username": "",
        "header": "Arlette Willis",
        "text": "professor in Curriculum & Instruction was elected into the Reading Hall of Fame, an independent organization that recognizes lifetime achievements in the field of reading. Six new living members and four deceased members were elected to join. Willis was also honored with the 2019 John J. Gumperz Memorial Award for Distinguished Lifetime Scholarship from the American Educational Research Association. Willis recently contributed to the handbook, A Sociocultural Perspective on Readers, Reading, Reading Instruction and Assessment, Reading Policy, and Reading Research."
    }
]