[
    {
        "speaker": "James D. Anderson, Dean and Gutgsell Professor",
        "title": "Addressing Anti-Black Racism and the Rise of Global Protests: Is it Different This Time?",
        "description": "Anderson’s scholarship focuses broadly on the history of U.S. education, with specializations in the history of African American education in the South, the history of higher education desegregation, the history of public school desegregation, and the history of African American school achievement in the 20th century."
    },
    {
        "speaker": "Christopher Span, Associate Dean for Graduate Programs and Professor of EPOL",
        "title": "Historical Contexts and Lessons About Racism in the U.S. that Everyone Should Know",
        "description": "Span’s research interests primarily pertain to the educational history of 19th and 20th century African Americans and his scholarship is widely recognized in varying fields in education."
    },
    {
        "speaker": "Rochelle Gutiérrez, Professor of C&I",
        "title": "How do we Transform Teacher Education? As Early as Pre-K, How Do We Instill Dispositions of Equality and Inclusivity?",
        "description": "Gutiérrez’ scholarship focuses on issues of identity and power in mathematics education, paying particular attention to how race, class, and language affect teaching and learning. Through in-depth analyses of effective teaching/ learning communities and longitudinal studies of developing and practicing teachers, her work challenges deficit views of students who are Latinx, Black, and Indigenous."
    },
    {
        "speaker": "Adrienne Dixson, Professor of EPOL",
        "title": "The Role of Educational Researchers in Bringing Systemic Racism to Light, and What Whites Can Do, Beyond Statements, to Move Toward Dismantling It",
        "description": "Dixson’s primary research interest focuses on how issues of race, class, and gender intersect and impact educational equity in urban schooling contexts. She locates her research within two theoretical frameworks: Critical Race Theory and Black Feminist Theories."
    },
    {
        "speaker": "Rodney Hopson, Professor of EPSY",
        "title": "Global Awareness of Anti-Black Violence and Racism and How it’s Become a Protest Movement Worldwide",
        "description": "Hopson’s research interests lie in social politics and policies, foundations of education, sociolinguistics, ethnography, and evaluation. Relative to his research interests, Hopson raises questions that address the differential impact of education and schooling on marginalized and underrepresented groups in diverse global nation states and seek solutions to social and educational conditions in the form of alternative paradigms, epistemologies, and methods for the way the oppressed succeed and thrive despite circumstances and opportunities that suggest otherwise."
    },
    {
        "speaker": "William Trent, Professor of EPOL",
        "title": "Impacts of Systemic Racism on Health and Within Socio-political Structures",
        "description": "Trent’s lifelong research has focused on the Sociology of Education: educational inequality; race and ethnicity; and complex organization/social change/ education policy."
    }
]